//=============================================================================
//
// ゲーム画面処理 [game.cpp]
// Author : 麦英泳
//
//=============================================================================
#include "game.h"
#include "light.h"
#include "basicScene.h"
#include "particleStar.h"
#include "mouse.h"
#include "timer.h"
#include "sound.h"

#include "cancer.h"
#include "sagittarius.h"
#include "pisces.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

//*****************************************************************************
// グローバル変数
//*****************************************************************************


//=============================================================================
// 初期化処理
//=============================================================================
HRESULT InitGame(void)
{
	// タイマーの初期化
	InitTimer();
	ResetTimer();

	InitMouse();

	InitCancer();

	InitSagittarius();

	InitPisces();

	// BGM再生 ちゃんとloopできるにする!
	PlaySound(SOUND_LABEL_BGM000, XAUDIO2_LOOP_INFINITE);

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void UninitGame(void)
{
	// タイマーの終了処理
	UninitTimer();

	UninitBasicScene();

	UninitParticleStar();

	UnintMouse();

	UnintCancer();

	UnintSagittarius();

	UnintPisces();

	// BGM停止
	StopSound(SOUND_LABEL_BGM000);
}

//=============================================================================
// 更新処理
//=============================================================================
void UpdateGame(void)
{
	UpdateBasicScene();
	UpdateParticleStar();

	UpdateMouse();

	UpdateCancer();

	UpdateSagittarius();

	UpdatePisces();

	// タイマー処理の更新
	UpdateTimer();

}

//=============================================================================
// 描画処理 描画順注意
//=============================================================================
void DrawGame(void)
{
	DrawBasicScene();//背景
	DrawParticleStar();

	//DrawCancer();

	DrawSagittarius();

	//DrawPisces();

	DrawMouse();

	// タイマー処理の描画
	DrawTimer();

}

