//=============================================================================
//
// 枠
// Author : GP11A_341_22_田中太陽
//
//=============================================================================
#ifndef _STACK_H_
#define _STACK_H_

#include "main.h"
#include "seiza.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

#define	STACK_SIZE					(SCREEN_WIDTH / 12.0f)		// スタックの幅
#define	STACK_POS_X					(0.0f)			// スタックの枠表示位置
#define	STACK_POS_Y					(SCREEN_HEIGHT - STACK_SIZE)		// スタックの表示位置


typedef struct {

	bool		use;
	int			texNum;		//色　0赤　1青

}STACK;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitStack(int type);
void UninitStack(void);
void UpdateStack(void);
void DrawStack(void);

#endif
